Revit 2026 API

# PresetInitialColor(PresetInitialColor) Constructor

---

Creates a copy of the given preset initial color

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PresetInitialColor(
	PresetInitialColor other
)
```
```vb
Public Sub New (
	other As PresetInitialColor
)
```
```cpp
public:
PresetInitialColor(
	PresetInitialColor^ other
)
```
```fsharp
new :
        other : PresetInitialColor -> PresetInitialColor
```

#### Parameters

other PresetInitialColor

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PresetInitialColor Class

PresetInitialColor Overload

Autodesk.Revit.DB.Lighting Namespace